_ᖗᖗᖘᕾ = function (_ᕸᖆᖚᕿ, _ᖙᕴᕾᕶ) {
    var _ᖗᖗᖘᕾ = _ᕵᖘᕾᖃ.$_Ct
        , _ᖈᕹᕴᖃ = ["$_DABJy"].concat(_ᖗᖗᖘᕾ)
        , _ᕺᖂᖃᕿ = _ᖈᕹᕴᖃ[1];
    _ᖈᕹᕴᖃ.shift();
    var _ᕸᕺᖂᖗ = _ᖈᕹᕴᖃ[0];
    if (!(_ᖆᕸᕶᖁ = _ᖙᕴᕾᕶ[_ᖗᖗᖘᕾ(476)])[_ᖗᖗᖘᕾ(667)] || _ᖗᖗᖘᕾ(138) === _ᖆᕸᕶᖁ[_ᖗᖗᖘᕾ(667)])
        return _ᖘᕹᕴᕸ[_ᕺᖂᖃᕿ(183)][_ᖗᖗᖘᕾ(976)](_ᕸᖆᖚᕿ);
    var _ᖂᕺᕸᖂ = (0,
        _ᕹᕾᕶᖙ[_ᖗᖗᖘᕾ(192)])()
        , _ᕷᖉᕹᖈ = new _ᕹᕾᕶᖙ[_ᕺᖂᖃᕿ(18)]([_ᖗᖗᖘᕾ(861), _ᖗᖗᖘᕾ(882)])
        , _ᖙᕴᕾᕶ = {
            1: {
                symmetrical: _ᖁᖈᕶᕶ[_ᕺᖂᖃᕿ(183)],
                asymmetric: new _ᖆᖆᖘᕴ[_ᖗᖗᖘᕾ(183)]
            },
            2: {
                symmetrical: new _ᕿᕶᖆᕺ[_ᖗᖗᖘᕾ(183)]({
                    key: _ᖂᕺᕸᖂ,
                    mode: _ᖗᖗᖘᕾ(913),
                    iv: _ᕺᖂᖃᕿ(993)
                }),
                asymmetric: _ᖉᖘᖂᕾ[_ᖗᖗᖘᕾ(183)]
            }
        };
    if (_ᕷᖉᕹᖈ[_ᖗᖗᖘᕾ(129)](_ᖆᕸᕶᖁ[_ᕺᖂᖃᕿ(667)])) {
        var i = _ᖗᖗᖘᕾ(861) === _ᖆᕸᕶᖁ[_ᖗᖗᖘᕾ(667)]
            , _ᖆᕸᕶᖁ = _ᖆᕸᕶᖁ[_ᖗᖗᖘᕾ(667)]
            , r = _ᖙᕴᕾᕶ[_ᖆᕸᕶᖁ][_ᕺᖂᖃᕿ(905)][_ᖗᖗᖘᕾ(990)](_ᖂᕺᕸᖂ);
        while (i && (!r || 256 !== r[_ᖗᖗᖘᕾ(107)]))
            _ᖂᕺᕸᖂ = (0,
                _ᕹᕾᕶᖙ[_ᕺᖂᖃᕿ(192)])(),
                r = (new _ᖆᖆᖘᕴ[_ᕺᖂᖃᕿ(183)])[_ᖗᖗᖘᕾ(990)](_ᖂᕺᕸᖂ);
        _ᕸᖆᖚᕿ = _ᖙᕴᕾᕶ[_ᖆᕸᕶᖁ][_ᕺᖂᖃᕿ(980)][_ᕺᖂᖃᕿ(990)](_ᕸᖆᖚᕿ, _ᖂᕺᕸᖂ);
        return (0,
            _ᕹᕾᕶᖙ[_ᖗᖗᖘᕾ(142)])(_ᕸᖆᖚᕿ) + r
    }
}





_ᕸᖆᖚᕿ = _ᖆᖚᕾᕺ[_ᕸᕺᖂᖗ(183)](_ᕸᕿᖂᖁ[_ᕸᕺᖂᖗ(183)][_ᕸᕺᖂᖗ(527)](_ᕸᖆᖚᕿ), _ᖆᕸᕶᖁ)